// 授業日程データ
// 月数に上限はありません。追加したい日付を "YYYY-MM-DD": { ... }, の形で追加してください。
// 日付ごとのデータの間はカンマで区切ります。最後のデータの後ろのカンマは省略しても構いません。
const dateTimetable = {
        "2026-09-28": {
            "1年次": ["数学Ⅰ（P110-111）", "歴史総合（P128-133）", "社会の架け橋プログラム（1年次ZOOM またはYouTube）"],
            "2年次": ["保健（P86-91）", "数学A（P64-65）", "社会の架け橋プログラム（1年次ZOOM またはYouTube）"],
            "3年次": ["政治・経済（P156-171）", "地学基礎（P141-144）", "社会の架け橋プログラム（1年次ZOOM またはYouTube）"]
        },
        "2026-09-29": {
            "1年次": ["公共（P122-127）", "現代の国語（レポート④）", "地理探究（P216-223）"],
            "2年次": ["美術Ⅰ（P80-81）", "倫理（P125-130）", "数学A（P66-67）"],
            "3年次": ["化学基礎（P130-131）", "数学Ⅱ（P86-87）", "体育②（レポート②）"]
        },
        "2026-09-30": {
            "1年次": ["言語文化（P178-179）", "英語CⅠ（レポート⑤）", "総合的探究①（№2-4・キャンパス毎に実施）"],
            "2年次": ["生物基礎（P106-107）", "論理国語（P193-196）", "体育②（レポート②）"],
            "3年次": ["数学Ⅱ（P88-89）", "化学基礎（P131-133）", "総合的探究③（№2-3・キャンパス毎に実施）"]
        },
        "2026-10-01": {
            "1年次": ["家庭総合（P162-175）", "科学と人間生活（P118-123）", "言語文化（P180-183）"],
            "2年次": ["論理国語（P196-199）", "日本史探究（P188-191）", "生物基礎（P84-85、P108-111）"],
            "3年次": ["地理探究（P224-227）", "古典探究（レポート⑧）", "数学Ⅱ（P90-91）"]
        },
        "2026-10-02": {
            "1年次": ["科学と人間生活（P124-127）", "数学Ⅰ（P114-115）", "英語CⅠ（P93）"],
            "2年次": ["地理総合（探究学習）", "論理・表現Ⅰ（P94-99）", "日本史探究（P192-195）"],
            "3年次": ["情報Ⅰ（P76-90）", "古典探究（P190-191）", "地学基礎（P144-145）"]
        },
        "2026-10-05": {
            "1年次": ["数学Ⅰ（P116）", "歴史総合（レポート④）", "社会の架け橋プログラム（1年次ZOOM またはYouTube）"],
            "2年次": ["保健（P92-95）", "数学A（P67-69）", "社会の架け橋プログラム（1年次ZOOM またはYouTube）"],
            "3年次": ["政治・経済（P172-181）", "地学基礎（P146-147）", "社会の架け橋プログラム（1年次ZOOM またはYouTube）"]
        },
        "2026-10-06": {
            "1年次": ["公共（P134-137）", "現代の国語（P152-159）", "数学Ⅰ（レポート⑥）"],
            "2年次": ["美術Ⅰ（P80-81）", "倫理（P132-140）", "数学A（P70-71）"],
            "3年次": ["化学基礎（P134-135）", "数学Ⅱ（P92-94）", "地理探究（P228-235）"]
        },
        "2026-10-07": {
            "1年次": ["言語文化（P180-183）", "英語CⅠ（P86-87）", "HR（キャンパス毎に実施）"],
            "2年次": ["生物基礎（P112-115）", "論理国語（レポート⑧）", "総合的探求②（№2-2・キャンパス毎に実施）"],
            "3年次": ["数学Ⅱ（P95）", "化学基礎（P136-137）", "総合的探究③（№2-4・キャンパス毎に実施）"]
        },
        "2026-10-08": {
            "1年次": ["家庭総合（P169.175-193）", "科学と人間生活（P128-133）", "言語文化（P187-193）"],
            "2年次": ["論理国語（P210-214）", "日本史探究（P196-209）", "生物基礎（P116-117）"],
            "3年次": ["地理探究（P236-243）", "古典探究（P198-199）", "数学Ⅱ（レポート⑧）"]
        },
        "2026-10-09": {
            "1年次": ["科学と人間生活（P138-139）", "数学Ⅰ（P117）", "英語CⅠ（English day）"],
            "2年次": ["地理総合（P132-141）", "論理・表現Ⅰ（English day）", "日本史探究（P218-220）"],
            "3年次": ["English day", "古典探究（P200-201）", "地学基礎（P148-149）"]
        },
        "2026-10-13": {
            "1年次": ["公共（P142-149）", "現代の国語（P160-168）", "数学Ⅰ（P118-119）"],
            "2年次": ["美術Ⅰ（レポート④）", "倫理（P150-156）", "数学A（P72-73）"],
            "3年次": ["化学基礎（P137-139）", "数学Ⅱ（P96-97）", "地理探究（レポート⑦）"]
        },
        "2026-10-14": {
            "1年次": ["言語文化（P187-193）", "英語CⅠ（P88-91）", "HR（キャンパス毎に実施）"],
            "2年次": ["生物基礎（P118-121）", "論理国語（P214-218）", "HR（進路講座・キャンパス毎に実施）"],
            "3年次": ["数学Ⅱ（P97-99）", "化学基礎（P140-141）", "体育③（P182-187）"]
        },
        "2026-10-15": {
            "1年次": ["家庭総合（P194-203）", "科学と人間生活（P140-141）", "言語文化（P187-193）"],
            "2年次": ["論理国語（P219-222）", "日本史探究（P222-225）", "生物基礎（レポート④）"],
            "3年次": ["地理探究（P244-249）", "古典探究（レポート⑨）", "数学Ⅱ（P99-101）"]
        },
        "2026-10-16": {
            "1年次": ["科学と人間生活（P142-145）", "数学Ⅰ（P120-121）", "英語CⅠ（レポート⑥）"],
            "2年次": ["地理総合（P142-145）", "論理・表現Ⅰ（P100-105）", "日本史探究（P226-233）"],
            "3年次": ["情報Ⅰ（レポート③）", "古典探究（P208-210）", "地学基礎（P150-151）"]
        },
        "2026-10-19": {
            "1年次": ["数学Ⅰ（P122-123）", "歴史総合（P146-149、P164-165）", "社会の架け橋プログラム（1年次ZOOM またはYouTube）"],
            "2年次": ["保健（レポート⑤）", "数学A（P74-75）", "社会の架け橋プログラム（1年次ZOOM またはYouTube）"],
            "3年次": ["政治・経済（P182-192）", "地学基礎（P152-153）", "社会の架け橋プログラム（1年次ZOOM またはYouTube）"]
        },
        "2026-10-20": {
            "1年次": ["公共（レポート④）", "現代の国語（P160-168）", "数学Ⅰ（P124）"],
            "2年次": ["美術Ⅰ（レポート④）", "倫理（レポート④）", "数学A（レポート⑤）"],
            "3年次": ["化学基礎（P142-145）", "数学Ⅱ（P102-103）", "地理探究（P250-255）"]
        },
        "2026-10-21": {
            "1年次": ["言語文化（P198-199）", "英語CⅠ（P104-105）", "みらいの描き方講座（1年次ZOOM またはYouTube）"],
            "2年次": ["生物基礎（探究学習）", "論理国語（P222-227）", "みらいの描き方講座（1年次ZOOM またはYouTube）"],
            "3年次": ["数学Ⅱ（レポート⑨）", "化学基礎（P146-147）", "みらいの描き方講座（1年次ZOOM またはYouTube）"]
        },
        "2026-10-22": {
            "1年次": ["家庭総合（レポート⑥）", "科学と人間生活（P146-149）", "言語文化（P199-202）"],
            "2年次": ["論理国語（レポート⑨）", "日本史探究（レポート⑦）", "生物基礎（P128-131）"],
            "3年次": ["地理探究（P256-261）", "古典探究（P220-222）", "数学Ⅱ（P106-109）"]
        },
        "2026-10-23": {
            "1年次": ["科学と人間生活（P150-153）", "数学Ⅰ（P125）", "英語CⅠ（P102-103）"],
            "2年次": ["地理総合（P146-155）", "論理・表現Ⅰ（P106-111）", "日本史探究（P234-239）"],
            "3年次": ["情報Ⅰ（P91-95）", "古典探究（P225-226）", "地学基礎（P154-155）"]
        },
        "2026-10-26": {
            "1年次": ["数学Ⅰ（P126-127）", "歴史総合（P150-151、P162-163）", "社会の架け橋プログラム（1年次ZOOM またはYouTube）"],
            "2年次": ["保健（探究学習）", "数学A（P78-79）", "社会の架け橋プログラム（1年次ZOOM またはYouTube）"],
            "3年次": ["政治・経済（P193-203）", "地学基礎（P156-157）", "社会の架け橋プログラム（1年次ZOOM またはYouTube）"]
        },
        "2026-10-27": {
            "1年次": ["公共（P154-157）", "現代の国語（P169-176）", "数学Ⅰ（レポート⑦）"],
            "2年次": ["美術Ⅰ（P116-122）", "倫理（P157-174）", "数学A（P80-83）"],
            "3年次": ["化学基礎（レポート⑤）", "数学Ⅱ（P109-111）", "地理探求（P262-265）"]
        },
        "2026-10-28": {
            "1年次": ["言語文化（P199-202）", "英語CⅠ（P96-97）", "HR（キャンパス毎に実施）"],
            "2年次": ["生物基礎（P132-135）", "論理国語（P232-234）", "HR（キャンパス毎に実施）"],
            "3年次": ["数学Ⅱ（P112-113）", "化学基礎（P154-156）", "体育③（レポート②）"]
        },
        "2026-10-29": {
            "1年次": ["家庭総合（P204-217）", "科学と人間生活（レポート⑤）", "言語文化（レポート⑤）"],
            "2年次": ["論理国語（P234-239）", "日本史探究（P240-244）", "生物基礎（P136-137）"],
            "3年次": ["地理探究（P266-271）", "古典探究（レポート⑩）", "数学Ⅱ（P113）"]
        },
        "2026-10-30": {
            "1年次": ["科学と人間生活（P158-161）", "数学Ⅰ（P130-132）", "英語CⅠ（P98-101）"],
            "2年次": ["地理総合（レポート⑤）", "論理・表現Ⅰ（レポート⑤）", "日本史探究（P246-249）"],
            "3年次": ["情報Ⅰ（P96-99）", "古典探究（P228-240）", "地学基礎（P160）"]
        },
        "2026-11-02": {
            "1年次": ["数学Ⅰ（P）", "歴史総合（P）", "社会の架け橋プログラム（）"],
            "2年次": ["保健（P）", "数学A（P）", "社会の架け橋プログラム（）"],
            "3年次": ["政治・経済（P）", "地学基礎（P）", "社会の架け橋プログラム（）"],
        },
        "2026-11-03": {
            "1年次": ["公共（P）", "現代の国語（P）", "数学Ⅰ（P）"],
            "2年次": ["美術Ⅰ（P）", "倫理（P）", "数学A（P）"],
            "3年次": ["化学基礎（P）", "数学Ⅱ（P）", "地理探求（P）"],
        },
        "2026-11-04": {
            "1年次": ["言語文化（P）", "英語CⅠ（P）", ""],
            "2年次": ["生物基礎（P）", "論理国語（P）", ""],
            "3年次": ["数学Ⅱ（P）", "化学基礎（P）", ""],
        },
        "2026-11-05": {
            "1年次": ["家庭総合（P）", "科学と人間生活（P）", "言語文化（P）"],
            "2年次": ["論理国語（P）", "日本史探求（P）", "生物基礎（P）"],
            "3年次": ["地理探求（P）", "古典探求（P）", "数学Ⅱ（P）"],
        },
        "2026-11-06": {
            "1年次": ["科学と人間生活（P）", "数学Ⅰ（P）", "英語CⅠ（P）"],
            "2年次": ["地理総合（P）", "論理・表現Ⅰ（P）", "日本史探求（P）"],
            "3年次": ["情報Ⅰ（P）", "古典探求（P）", "地学基礎（P）"],
        },
        "2026-11-09": {
            "1年次": ["数学Ⅰ（P）", "歴史総合（P）", "社会の架け橋プログラム（）"],
            "2年次": ["保健（P）", "数学A（P）", "社会の架け橋プログラム（）"],
            "3年次": ["政治・経済（P）", "地学基礎（P）", "社会の架け橋プログラム（）"],
        },
        "2026-11-10": {
            "1年次": ["公共（P）", "現代の国語（P）", "数学Ⅰ（P）"],
            "2年次": ["美術Ⅰ（P）", "倫理（P）", "数学A（P）"],
            "3年次": ["化学基礎（P）", "数学Ⅱ（P）", "地理探求（P）"],
        },
        "2026-11-11": {
            "1年次": ["言語文化（P）", "英語CⅠ（P）", ""],
            "2年次": ["生物基礎（P）", "論理国語（P）", ""],
            "3年次": ["数学Ⅱ（P）", "化学基礎（P）", ""],
        },
        "2026-11-12": {
            "1年次": ["家庭総合（P）", "科学と人間生活（P）", "言語文化（P）"],
            "2年次": ["論理国語（P）", "日本史探求（P）", "生物基礎（P）"],
            "3年次": ["地理探求（P）", "古典探求（P）", "数学Ⅱ（P）"],
        },
        "2026-11-13": {
            "1年次": ["科学と人間生活（P）", "数学Ⅰ（P）", "英語CⅠ（P）"],
            "2年次": ["地理総合（P）", "論理・表現Ⅰ（P）", "日本史探求（P）"],
            "3年次": ["情報Ⅰ（P）", "古典探求（P）", "地学基礎（P）"],
        },
        "2026-11-16": {
            "1年次": ["数学Ⅰ（P）", "歴史総合（P）", "社会の架け橋プログラム（）"],
            "2年次": ["保健（P）", "数学A（P）", "社会の架け橋プログラム（）"],
            "3年次": ["政治・経済（P）", "地学基礎（P）", "社会の架け橋プログラム（）"],
        },
        "2026-11-17": {
            "1年次": ["公共（P）", "現代の国語（P）", "数学Ⅰ（P）"],
            "2年次": ["美術Ⅰ（P）", "倫理（P）", "数学A（P）"],
            "3年次": ["化学基礎（P）", "数学Ⅱ（P）", "地理探求（P）"],
        },
        "2026-11-18": {
            "1年次": ["言語文化（P）", "英語CⅠ（P）", ""],
            "2年次": ["生物基礎（P）", "論理国語（P）", ""],
            "3年次": ["数学Ⅱ（P）", "化学基礎（P）", ""],
        },
        "2026-11-19": {
            "1年次": ["家庭総合（P）", "科学と人間生活（P）", "言語文化（P）"],
            "2年次": ["論理国語（P）", "日本史探求（P）", "生物基礎（P）"],
            "3年次": ["地理探求（P）", "古典探求（P）", "数学Ⅱ（P）"],
        },
        "2026-11-20": {
            "1年次": ["科学と人間生活（P）", "数学Ⅰ（P）", "英語CⅠ（P）"],
            "2年次": ["地理総合（P）", "論理・表現Ⅰ（P）", "日本史探求（P）"],
            "3年次": ["情報Ⅰ（P）", "古典探求（P）", "地学基礎（P）"],
        },
        "2026-11-23": {
            "1年次": ["数学Ⅰ（P）", "歴史総合（P）", "社会の架け橋プログラム（）"],
            "2年次": ["保健（P）", "数学A（P）", "社会の架け橋プログラム（）"],
            "3年次": ["政治・経済（P）", "地学基礎（P）", "社会の架け橋プログラム（）"],
        },
        "2026-11-24": {
            "1年次": ["公共（P）", "現代の国語（P）", "数学Ⅰ（P）"],
            "2年次": ["美術Ⅰ（P）", "倫理（P）", "数学A（P）"],
            "3年次": ["化学基礎（P）", "数学Ⅱ（P）", "地理探求（P）"],
        },
        "2026-11-25": {
            "1年次": ["言語文化（P）", "英語CⅠ（P）", ""],
            "2年次": ["生物基礎（P）", "論理国語（P）", ""],
            "3年次": ["数学Ⅱ（P）", "化学基礎（P）", ""],
        },
        "2026-11-26": {
            "1年次": ["家庭総合（P）", "科学と人間生活（P）", "言語文化（P）"],
            "2年次": ["論理国語（P）", "日本史探求（P）", "生物基礎（P）"],
            "3年次": ["地理探求（P）", "古典探求（P）", "数学Ⅱ（P）"],
        },
        "2026-11-27": {
            "1年次": ["科学と人間生活（P）", "数学Ⅰ（P）", "英語CⅠ（P）"],
            "2年次": ["地理総合（P）", "論理・表現Ⅰ（P）", "日本史探求（P）"],
            "3年次": ["情報Ⅰ（P）", "古典探求（P）", "地学基礎（P）"],
        },
        "2026-11-30": {
            "1年次": ["数学Ⅰ（P）", "歴史総合（P）", "社会の架け橋プログラム（）"],
            "2年次": ["保健（P）", "数学A（P）", "社会の架け橋プログラム（）"],
            "3年次": ["政治・経済（P）", "地学基礎（P）", "社会の架け橋プログラム（）"],
        }
    };
