const dateTimetable = {
    "2026-11-02": {
        "1年次": ["数学Ⅰ（P）", "歴史総合（P）", "社会の架け橋プログラム（）"],
        "2年次": ["保健（P）", "数学A（P）", "社会の架け橋プログラム（）"],
        "3年次": ["政治・経済（P）", "地学基礎（P）", "社会の架け橋プログラム（）"]
    },
    "2026-11-03": {
        "1年次": ["公共（P）", "現代の国語（P）", "数学Ⅰ（P）"],
        "2年次": ["美術Ⅰ（P）", "倫理（P）", "数学A（P）"],
        "3年次": ["化学基礎（P）", "数学Ⅱ（P）", "地理探求（P）"]
    },
    "2026-11-04": {
        "1年次": ["言語文化（P）", "英語CⅠ（P）", ""],
        "2年次": ["生物基礎（P）", "論理国語（P）", ""],
        "3年次": ["数学Ⅱ（P）", "化学基礎（P）", ""]
    },
    "2026-11-05": {
        "1年次": ["家庭総合（P）", "科学と人間生活（P）", "言語文化（P）"],
        "2年次": ["論理国語（P）", "日本史探求（P）", "生物基礎（P）"],
        "3年次": ["地理探求（P）", "古典探求（P）", "数学Ⅱ（P）"]
    },
    "2026-11-06": {
        "1年次": ["科学と人間生活（P）", "数学Ⅰ（P）", "英語CⅠ（P）"],
        "2年次": ["地理総合（P）", "論理・表現Ⅰ（P）", "日本史探求（P）"],
        "3年次": ["情報Ⅰ（P）", "古典探求（P）", "地学基礎（P）"]
    },

    "2026-11-09": {
        "1年次": ["数学Ⅰ（P）", "歴史総合（P）", "社会の架け橋プログラム（）"],
        "2年次": ["保健（P）", "数学A（P）", "社会の架け橋プログラム（）"],
        "3年次": ["政治・経済（P）", "地学基礎（P）", "社会の架け橋プログラム（）"]
    },
    "2026-11-10": {
        "1年次": ["公共（P）", "現代の国語（P）", "数学Ⅰ（P）"],
        "2年次": ["美術Ⅰ（P）", "倫理（P）", "数学A（P）"],
        "3年次": ["化学基礎（P）", "数学Ⅱ（P）", "地理探求（P）"]
    },
    "2026-11-11": {
        "1年次": ["言語文化（P）", "英語CⅠ（P）", ""],
        "2年次": ["生物基礎（P）", "論理国語（P）", ""],
        "3年次": ["数学Ⅱ（P）", "化学基礎（P）", ""]
    },
    "2026-11-12": {
        "1年次": ["家庭総合（P）", "科学と人間生活（P）", "言語文化（P）"],
        "2年次": ["論理国語（P）", "日本史探求（P）", "生物基礎（P）"],
        "3年次": ["地理探求（P）", "古典探求（P）", "数学Ⅱ（P）"]
    },
    "2026-11-13": {
        "1年次": ["科学と人間生活（P）", "数学Ⅰ（P）", "英語CⅠ（P）"],
        "2年次": ["地理総合（P）", "論理・表現Ⅰ（P）", "日本史探求（P）"],
        "3年次": ["情報Ⅰ（P）", "古典探求（P）", "地学基礎（P）"]
    },

    "2026-11-16": {
        "1年次": ["数学Ⅰ（P）", "歴史総合（P）", "社会の架け橋プログラム（）"],
        "2年次": ["保健（P）", "数学A（P）", "社会の架け橋プログラム（）"],
        "3年次": ["政治・経済（P）", "地学基礎（P）", "社会の架け橋プログラム（）"]
    },
    "2026-11-17": {
        "1年次": ["公共（P）", "現代の国語（P）", "数学Ⅰ（P）"],
        "2年次": ["美術Ⅰ（P）", "倫理（P）", "数学A（P）"],
        "3年次": ["化学基礎（P）", "数学Ⅱ（P）", "地理探求（P）"]
    },
    "2026-11-18": {
        "1年次": ["言語文化（P）", "英語CⅠ（P）", ""],
        "2年次": ["生物基礎（P）", "論理国語（P）", ""],
        "3年次": ["数学Ⅱ（P）", "化学基礎（P）", ""]
    },
    "2026-11-19": {
        "1年次": ["家庭総合（P）", "科学と人間生活（P）", "言語文化（P）"],
        "2年次": ["論理国語（P）", "日本史探求（P）", "生物基礎（P）"],
        "3年次": ["地理探求（P）", "古典探求（P）", "数学Ⅱ（P）"]
    },
    "2026-11-20": {
        "1年次": ["科学と人間生活（P）", "数学Ⅰ（P）", "英語CⅠ（P）"],
        "2年次": ["地理総合（P）", "論理・表現Ⅰ（P）", "日本史探求（P）"],
        "3年次": ["情報Ⅰ（P）", "古典探求（P）", "地学基礎（P）"]
    },

    "2026-11-23": {
        "1年次": ["数学Ⅰ（P）", "歴史総合（P）", "社会の架け橋プログラム（）"],
        "2年次": ["保健（P）", "数学A（P）", "社会の架け橋プログラム（）"],
        "3年次": ["政治・経済（P）", "地学基礎（P）", "社会の架け橋プログラム（）"]
    },
    "2026-11-24": {
        "1年次": ["公共（P）", "現代の国語（P）", "数学Ⅰ（P）"],
        "2年次": ["美術Ⅰ（P）", "倫理（P）", "数学A（P）"],
        "3年次": ["化学基礎（P）", "数学Ⅱ（P）", "地理探求（P）"]
    },
    "2026-11-25": {
        "1年次": ["言語文化（P）", "英語CⅠ（P）", ""],
        "2年次": ["生物基礎（P）", "論理国語（P）", ""],
        "3年次": ["数学Ⅱ（P）", "化学基礎（P）", ""]
    },
    "2026-11-26": {
        "1年次": ["家庭総合（P）", "科学と人間生活（P）", "言語文化（P）"],
        "2年次": ["論理国語（P）", "日本史探求（P）", "生物基礎（P）"],
        "3年次": ["地理探求（P）", "古典探求（P）", "数学Ⅱ（P）"]
    },
    "2026-11-27": {
        "1年次": ["科学と人間生活（P）", "数学Ⅰ（P）", "英語CⅠ（P）"],
        "2年次": ["地理総合（P）", "論理・表現Ⅰ（P）", "日本史探求（P）"],
        "3年次": ["情報Ⅰ（P）", "古典探求（P）", "地学基礎（P）"]
    },

    "2026-11-30": {
        "1年次": ["数学Ⅰ（P）", "歴史総合（P）", "社会の架け橋プログラム（）"],
        "2年次": ["保健（P）", "数学A（P）", "社会の架け橋プログラム（）"],
        "3年次": ["政治・経済（P）", "地学基礎（P）", "社会の架け橋プログラム（）"]
    }
};
